{ "articles": [{
    "title": "This Giant Chicken Is Real & Legit Terrifying",
    "author": "Megan Grant",
    "description": "Loch Ness. Bigfoot. Giant chicken. One of these things actyally exists, and its not the one you want. A video recently surfaced online of the biggest poultry meat you've ever seen..",
    "body": "Loch Ness. Bigfoot. Giant chicken. One of these things actually exists, and it's not the one you want. A video recently surfaced online of the biggest poultry meat you've ever seen, leaving viewers asking one crucial question: Is this giant chicken real? We're all going to have nightmares tonight, because yes, it's real. And it's legitimately a behemoth of a chicken. It appears to be roughly the weight of a horse. Except it's a chicken. Upon seeing this video, my first thought was that this poor chicken was jacked up on steroids and hormones in preparation to be slaughtered. It could easily feed the Brady bunch for a week, at least. But my suspicions were incorrect. It's actually a breed called the Brahma chicken, and they were once the most in-demand meat in our country, sometimes reaching over 18 pounds. If you think this sounds like the plot line of a 1950s claymation sci-fi/horror movie, you would be correct. In the chicken's big video debut, it exist its coop, looking relatively normal at first. But you soon realize its massive size, and you instantly know you'd never want to cross this beast in a dark alley. I can't do it justice. Just look for yourself. If old MacDonald had a farm, I'm guessing all the other animals jumped ship after they met this chicken.Then again, my fear of the Brahma chicken might be slightly misguided and irrational. According to My Pet Chicken, they're 'gentle giant' and make great pets because they're quiet, tame, and great huggers. (I'd like to speak to the person who got close enough to hug one.) The Livestock Conservancy agrees, stating that Brahma chickens are calm and docile.It looks like we really don't need to fear the 'King of all poultry,' as the Brahma chicken might be colossal but is a total softy on the inside. I'll just take their word for it.",
    "image":"https://typeset-beta.imgix.net/2017/3/21/c98a0ee8-14e6-4d0f-9b3b-7a9b111571b5.jpg"
  }, {
    "title": "This Sorting Hat Theory Explains *So* Much",
    "author": "Emma Oulton",
    "description": "if you've ever suddenly sat bolt upright in bed at three in the morning and shouted, 'But why was Peter Pettigrew in Gryffindor?' -you're note alone.",
    "body": "If you've ever suddenly sat bolt upright in bed at three in the morning and shouted, 'But why was Peter Pettigrew in Gryffindor?' — you're not alone. It just doesn't add up! But a fan theory about the Sorting Hat may have just answered our questions forever. According to the Harry Potter books, the Sorting Hat divides children up based on qualities: intelligence for Ravenclaw, bravery for Gryffindor, cunning for Slytherin, and, um, everything else for Hufflepuff. As children, we always just accepted that — but on the fifth or sixth re-reading of the books, there are a few things that just don't seem to add up. Like, why is Peter Pettigrew in Gryffindor when he's so spineless? Why are Crabbe and Goyle in Slytherin when they're about as cunning as a panda? And why, for the love of McGonagall, isn't Hermione Granger in Ravenclaw? That's what Reddit user Straw_Boats was wondering, and so came up with this possible solution: the Sorting Hat sorts students based on the qualities they value, rather than the ones they possess. Of course, this isn't totally news. Dumbledore already explained to Harry in Chamber of Secrets that his choice to be in Gryffindor is what defined him as a true Gryff. But Straw_Boats's theory finally connects the rest of the dots. Hermione's intelligence could definitely have landed her in Ravenclaw — but when it comes down to it, she values bravery above 'books and cleverness.' Crabbe and Goyle are never going to be criminal masterminds, but they look up to their cunning peers, making them Slytherin to the core. And Peter Pettigrew might be a treacherous little rat, but he admired his brave friends to the end — even if he was never courageous enough to stick up for them when it really mattered. Straw_Boats concludes that the house system is in serious need of a makeover — and much as I hate to criticize anything that J.K. Rowling created, I do have to agree. Dividing children up by the qualities that they prize surely isn't the best way to raise well-rounded students — and what about teaching them that bravery, ambition, intelligence, and loyalty are all important? Yep, there are probably some more sleepless nights in our future worrying about the flaws at Hogwarts — but the question of how the Sorting Hat works will never trouble us again.",
    "image":"https://typeset-beta.imgix.net/2017/3/21/551e3135-c34e-4ac2-b6aa-c083fc83dd1b.jpg"
  }, {
    "title": "These Cartoon Network Shows Were Your '90s Jam",
    "author": "Amy Roberts",
    "description": "I'm sure I dont need to tell yoir that the '90s were a stellar time for childrends TV shows. Just like I dont need to tell your that there was also a slew of Catroon Network shows that you loved...'",
    "body": "I'm sure I don't need to tell you that the '90s were a stellar time for children's TV shows. Just like I don't need to tell you that there was also a slew of Cartoon Network shows that you loved in the '90s and would always make time for. The best Cartoon Network shows of the '90s were serving up unique toons that felt truly original. These were shows that were ridiculous, hilarious, anarchic, stupid, inspiring, and, most importantly, easy to watch. It was so easy to switch over to Cartoon Network back in the '90s and find yourself pulled into its programming for the rest of the day. While many of these were original shows, others were shows that were retrieved from stations like The WB or CBS, so they could continue to be screened in reruns on the station. And thank goodness for that, because the mixture of content really worked. There was, and still is, no mistaking the unique charm of a Cartoon Network original show, but those charms also played out wonderfully among the weird and wonderful variety of other cartoons featured on the channel. There was nothing better than saving up a bunch of snacks and sitting down in front of the TV to marathon watch whatever shows Cartoon Network was serving up that day. If it was a really great day, then odds are all of the following shows would have been on...",
    "image":"https://typeset-beta.imgix.net/2017/3/21/a08c30f6-a736-4047-93a9-30587b4fc0bd.png"
  }]
}
